МитапEDT/src/DataProcessors/БлокЕсли/БлокЕсли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>БлокЕсли</name>
</mdclass:DataProcessor>

МитапEDT/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
  <enumValues>
    <name>НДС21</name>
  </enumValues>
</mdclass:Enum>

МитапEDT/src/DataProcessors/БлокЕсли/ObjectModule.bsl
// Повторяющиеся условия в синтаксической конструкции Если...Тогда...ИначеЕсли...
//
Функция ПроцентПоСтавкеНДС(СтавкаНДС) Экспорт
	
	Перем Процент;	
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Процент = 0;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Процент = 10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Процент = 18;	
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Процент = 18;	
	КонецЕсли;
	
	Возврат Процент;
	
КонецФункции

// Повторяющиеся блоки кода в синтаксической конструкции Если...Тогда...ИначеЕсли...
//
Функция ПроцентПоСтавкеНДСВторойПодход(СтавкаНДС) Экспорт
	
	Перем Процент;	
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Процент = 0;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Процент = 10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Процент = 18;	
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Процент = 20;	
	КонецЕсли;
	
	Возврат Процент;
	
КонецФункции

// Использование синтаксической конструкции Если...Тогда...ИначеЕсли...
//
Функция ПроцентПоСтавкеНДССТочкойКипения(СтавкаНДС) Экспорт
	
	Перем Процент;	
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Процент = 0;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Процент = 10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Процент = 18;	
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Процент = 20;	
	КонецЕсли;
	
	Возврат Процент;
	
КонецФункции

Функция ПроцентПоСтавкеНДСБезТочкиКипения(СтавкаНДС) Экспорт
	
	Перем Процент;	
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Процент = 0;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Процент = 10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Процент = 18;	
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Процент = 20;	
	КонецЕсли;
	
	Возврат Процент;
	
КонецФункции

Процедура ПроверкаТочкиКипения()
	
	СтавкаНДС = Перечисления.СтавкиНДС.НДС21;
	Процент = ПроцентПоСтавкеНДССТочкойКипения(СтавкаНДС);
	
	Если Процент <> 21 Тогда
		Сообщить("А что пошло не так?");	
	КонецЕсли;
	
КонецПроцедуры
